---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning
source: html/af1a3bb9-4c10-6515-01be-4df0d9a793ad.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning Property

Run is joining landing with riser, so notch configuration does not take effect. Try to set run as begin/end with tread to make a notch.

## Syntax (C#)
```csharp
public static FailureDefinitionId RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning { get; }
```